
{"_meta":{"status":"SUCCESS","count":1},"records":[[{"articleID":"1551","lastChanged":"2014-04-02 21:49:00","title":"Rangers Road Trip","link":"http:\/\/thewichitan.com\/rangers-road-trip\/","comments":"http:\/\/thewichitan.com\/rangers-road-trip\/#respond","pubDate":"Wed, 02 Apr 2014 16:57:52 +0000","docCreator":"Cooper Miller","category1":"Campus","category2":"","shortDescription":"<p>The University Programming Board will be selling Texas Rangers tickets for $10 and providing a shuttle for transportation on Saturday April 12, leaving from the bookstore entrance of the Clark Student Center at 2:30 p.m. to the Texas Rangers game against the Houston Astros. But with a ticket price of only $10, don’t expect to [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/rangers-road-trip\/\">Rangers Road Trip<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"The University Programming Board will be selling Texas Rangers tickets for $10 and providing a shuttle for transportation on Saturday April 12, leaving from the bookstore entrance of the Clark Student Center at 2:30 p.m. to the Texas Rangers game against the Houston Astros.\nBut with a ticket price of only $10, don’t expect to be in nose-bleeds. The event, chose by the UPB’s Late Night\/Weekend chair Erin Hagy actually has pretty good seats, according to Mario Ramirez, Student Development and Orientation Activities coordinator.\n“We got lower reserved seats,” Ramirez said. “They are costing us a little more, but we are selling them to students for $10, which includes a ticket and bus ride.”\nRamirez said they have 22 tickets that will be distributed on a first come, first serve basis beginning April 3.\nBecause the Rangers just had their season opener Monday, March 31 against the Philadelphia Phillies, a game they lost 14 to 10, Ramirez said he expects the 22 tickets to go fast.\n“I think it would be a fun trip,” said Lindsey Waltson, a sophomore in social work. “Especially with the weather starting to get nicer.”\nMatt Reaves, a sophomore in criminal justice, an avid Rangers fan, and baseball lover said he is also excited about the cheap opportunity.\n“I’ve been to multiple Rangers games and love it,” said Reaves. “Plus with the season just opening I bet it will be a good game.”\nTexas Rangers April Home Games\n\nFriday 04\/11 – Astros @ 7:05 p.m.\nSaturday 04\/12 – Astros @ 7:05 p.m.\nSunday 04\/13 – Astros @ 2:05 p.m.\nMonday 04\/14 – Mariners @ 7:05 p.m.\nTuesday 04\/15 – Mariners @ 7:05 p.m.\nWednesday 04\/16 &#8211; Mariners @ 7:05 p.m.\nThursday 04\/17  - Mariners @ 1:05 p.m.\nFriday 04\/18 – White Sox @ 7:05 p.m.\nSaturday 04\/19 – White Sox @ 7:05 p.m.\nSunday 04\/20 – White Sox @ 2:05 p.m.\nMonday 04\/28 – Athetics @ 7:05 p.m.\nTuesday 04\/29 – Athletics @ 7:05 p.m.\nWednesday 04\/30 – Athletics @ 7:05 p.m.\n\n&nbsp;\n&nbsp;\n&nbsp;\nThe post Rangers Road Trip appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1552","lastChanged":"2014-04-02 21:49:00","title":"Attend water forum","link":"http:\/\/thewichitan.com\/waterforum\/","comments":"http:\/\/thewichitan.com\/waterforum\/#respond","pubDate":"Wed, 02 Apr 2014 16:22:15 +0000","docCreator":"Ethan Metcalf","category1":"Op-Ed","category2":"","shortDescription":"<p>City representatives and members of Seeding Operations and Atmospheric Research, the weather modification company contracted for cloud seeding, will be at MSU this Saturday at 5 p.m. for a forum sponsored by Newschannel 6. Shawnee Theatre won&#8217;t seat 6,000 people unfortunately, but all students should go to the forum. With all the talk of creating as yet [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/waterforum\/\">Attend water forum<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"City representatives and members of Seeding Operations and Atmospheric Research, the weather modification company contracted for cloud seeding, will be at MSU this Saturday at 5 p.m. for a forum sponsored by Newschannel 6.\nShawnee Theatre won&#8217;t seat 6,000 people unfortunately, but all students should go to the forum. With all the talk of creating as yet undefined Stage 5 drought restrictions to match the worsening condition of the city&#8217;s water supply, this could be the chance to ask our representatives what those Stage 5 restrictions will be. Students should be pressing for information too, because the sooner we have an idea of the restrictions, the sooner we can all prepare for them.\nWichita Falls Mayor Glenn Barham said in a Campus Watch interview by Samantha Forester that with another 100 days of 100 degree temperatures like the summer of 2011, we have sufficient water to see us through mid-2016. That&#8217;s only one-and-a-half years of drinkable water.\nIf the direness of our situation is not already apparent enough, it will be when the athletic teams aren&#8217;t allowed to practice on the fields under NCAA regulations, or if resident students are charged for individual usage.\n&nbsp;\nThe post Attend water forum appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1553","lastChanged":"2014-04-02 21:49:00","title":"Artist Lecture Series brings in Ethan Zohn","link":"http:\/\/thewichitan.com\/artist-lecture-series-brings-ethan-zohn\/","comments":"http:\/\/thewichitan.com\/artist-lecture-series-brings-ethan-zohn\/#respond","pubDate":"Wed, 02 Apr 2014 16:14:27 +0000","docCreator":"Lowell Nash","category1":"Campus","category2":"","shortDescription":"<p>The student Artist Lecture Series committee will host Survivor winner Ethan Zohn April 3 in the Akin Auditorium at 7 p.m. He will present his lecture “Character: The Ultimate Survival Tool.&#8221; Zohn played professional soccer for the Hawaii Tsunami and Cape Cod Crusaders of the United Soccer Leagues before competing on and winning the third season [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/artist-lecture-series-brings-ethan-zohn\/\">Artist Lecture Series brings in Ethan Zohn<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"The student Artist Lecture Series committee will host Survivor winner Ethan Zohn April 3 in the Akin Auditorium at 7 p.m. He will present his lecture “Character: The Ultimate Survival Tool.&#8221;\nZohn played professional soccer for the Hawaii Tsunami and Cape Cod Crusaders of the United Soccer Leagues before competing on and winning the third season of Survivor. He used the $1 million winnings to co-found Grassroot Soccer, a non-profit organization dedicated to mobilizing the global soccer community to combat the AIDS epidemic in Africa.\nZohn was diagnosed with Hodgkin’s lymphoma, a rare form of cancer, and has since declared he is cancer free. Zohn turned his focus to speaking to high school, college, corporate and professional sports audiences about the significance of personal character.\n“Ethan Zohn has an inspiring background and story,” Matthew Park, associate vice president for student affairs and Artist Lecture Series committee advisor, said. “His lecture discusses the importance of integrity, fortitude, service and responsibilities. With all of the Greek activities going on this week, this lecture of service to others co-signs with what students involved with fraternities and sororities are exemplifying.”\nZohn is the last of four lecturers to in the 2013-2014 Artist Lecture Series.  Zohn follows in the footsteps of Drew Pinksy, Shaunette Hildabrand and most recently Pentatonix. Two of the lectures sold out. Dr. Drew sold out within days of his lecture while Pentatonix sold out days after tickets being available.\n“Zohn doesn’t have the same celebrity ‘Pow’ that attracted students to Dr. Drew or Pentatonix, but the message he shares is just as important,” Park said. “Only 150 tickets have been claimed, but that just means there are still plenty of tickets available for students.”\nTickets are free for students with a valid MSU ID, $20 for the general public and $18 for senior citizens, active-duty military and MSU alumni.\nThe Artist Lecture Series was created in 1964 to bring noted lecturers and quality programs in the performing arts to campus and the Wichita Falls community. The student Artist Lecture Series committee is taking applications for next year online. The committee will look over the applications and select students based on the requirements provided. The committee is responsible for searching for future lecturers.\n“The student committee is meeting sometime this month to discuss who they believe is a good fit for next year’s lecture season,&#8221; Park said. &#8221;As of now, we have zero confirmed lecturers.&#8221;\nThe post Artist Lecture Series brings in Ethan Zohn appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1554","lastChanged":"2014-04-02 21:49:00","title":"Flu cases reported as new semester starts","link":"http:\/\/thewichitan.com\/flu-outbreaks-campus\/","comments":"http:\/\/thewichitan.com\/flu-outbreaks-campus\/#respond","pubDate":"Wed, 02 Apr 2014 14:36:28 +0000","docCreator":"Kayla Sims","category1":"Uncategorized","category2":"","shortDescription":"<p>Flu Outbreak on Campus from MWSU Campus Watch on Vimeo. As the spring semester starts, there is a sickness, spreading across campus: the flu. The flu virus is the worst it&#8217;s been in five years and the campus physician, Dr. Keith Williamson, said he has already seen outbreaks this semester. &#8220;I didn&#8217;t tally them up, [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/flu-outbreaks-campus\/\">Flu cases reported as new semester starts<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n",
"longDescription":"\nFlu Outbreak on Campus from MWSU Campus Watch on Vimeo.\nAs the spring semester starts, there is a sickness, spreading across campus: the flu.\nThe flu virus is the worst it&#8217;s been in five years and the campus physician, Dr. Keith Williamson, said he has already seen outbreaks this semester.\n&#8220;I didn&#8217;t tally them up, but I could guess and I would say about a dozen that I have diagnosed as clearly and indisputably the flu,&#8221; Williamson said. \n\nSome flu-like symptoms include, high fever, chills, fatigue, body aches and dry coughing.\nWilliamson gave some tips that will help to prevent the flu.\n&#8220;Stay six feet away from people who have a cough, if you have a cough, cough into a Kleenex or into your sleeve and wash your hands frequently. Don&#8217;t share utensils, don&#8217;t share toothbrushes, towels, don&#8217;t share things that could be contaminated,&#8221; Williamson said.\nIf upcoming flu seasons continue to progress, one resident assistant said it would be a good idea to have a flu-awareness program.\nTiernan Harris, junior resident assistant, said. &#8221;Yeah, you could definitely talk to housing about it. I don&#8217;t think it&#8217;s come up yet because I don&#8217;t think we&#8217;ve had enough people to make it a big deal, but yeah, I think it would actually be a good thing.&#8221;\nStudents are able to get vaccinated for free at the Vincent Health Center with a valid student ID.\n\nSelf-assessment: CLICK HERE\nMWSU flu status: CLICK HERE\n\n&nbsp;\n&nbsp;\nThe post Flu cases reported as new semester starts appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1555","lastChanged":"2014-04-02 21:49:00","title":"Wellness center promotes a healthy lifestyle","link":"http:\/\/thewichitan.com\/wellness-center-promotes-getting-active\/","comments":"http:\/\/thewichitan.com\/wellness-center-promotes-getting-active\/#respond","pubDate":"Wed, 02 Apr 2014 14:36:03 +0000","docCreator":"Naomi Skinner","category1":"Campus","category2":"","shortDescription":"<p>Fair promotes healthy living with fun activities from MWSU Campus Watch on Vimeo. The Redwine Student Wellness Center hosted the 13th Annual Community Health Fair in the Fiatt gym of D.L. Ligon Coliseum. This event was held to make students, faculty and the surrounding community aware of the problems that affect the local area. Dozens [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/wellness-center-promotes-getting-active\/\">Wellness center promotes a healthy lifestyle<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"\nFair promotes healthy living with fun activities from MWSU Campus Watch on Vimeo.\nThe Redwine Student Wellness Center hosted the 13th Annual Community Health Fair in the Fiatt gym of D.L. Ligon Coliseum. This event was held to make students, faculty and the surrounding community aware of the problems that affect the local area. Dozens of booths and tables were set up such as the CPR table and the drunk driving table; both with a  message to deliver.\n&#8220;This one specifically covering CPR we want to teach everybody that they can do hands only CPR just to give them a little information on if they were to find somebody that actually went into cardiac arrest that they could actually help until emergency care got to the scene, &#8221; Randy Case, assistant professor of the respiratory department said.\nSeveral of the CPR students performed CPR lessons for students that were interested or passed by. Many booths would demonstrate their point in what they&#8217;re trying to get across. The drunk driving booth also had a good message.\n&#8220;We wanted to do something that was fun but something that was extremely relevant. Drunk driving is very prevalent in Wichita Falls and in Texas, and so we wanted to get the message out there, that while it is a fun simulation, it&#8217;s a very serious topic, so we chose drunk driving,&#8221; Vanessa Adams a senior in nursing said.\nWhile the booths were inside, a festive tent was set up outside. This promoted the being active lifestyle. It had free Zumba for anyone who wanted to try it out and you could even get t-shirts from the tent right across from it.\n&nbsp;\nThe post Wellness center promotes a healthy lifestyle appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1556","lastChanged":"2014-04-02 21:49:00","title":"Mills: Only freshmen in Trigg; Mustang Village to cost MSU students $2,400\/semester","link":"http:\/\/thewichitan.com\/new-freshman-housing-plans-upcoming-fall-semester\/","comments":"http:\/\/thewichitan.com\/new-freshman-housing-plans-upcoming-fall-semester\/#respond","pubDate":"Wed, 02 Apr 2014 14:26:03 +0000","docCreator":"Kayla Sims","category1":"Campus","category2":"","shortDescription":"<p>New freshman housing plans starting next fall semester from MWSU Campus Watch on Vimeo. Midwestern State University is seeing an increase in the number of freshman applicants for the upcoming fall semester. As the number of freshman students grow, so does the demand for on campus housing. Housing officials say they have a new option [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/new-freshman-housing-plans-upcoming-fall-semester\/\">Mills: Only freshmen in Trigg; Mustang Village to cost MSU students $2,400\/semester<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"\nNew freshman housing plans starting next fall semester from MWSU Campus Watch on Vimeo.\nMidwestern State University is seeing an increase in the number of freshman applicants for the upcoming fall semester. As the number of freshman students grow, so does the demand for on campus housing. Housing officials say they have a new option to solve this problem.\nDirector of Housing and Dining Services, Michael Mills, said,&#8221; This year, we&#8217;ve put in another option and that is formerly the Grove, that is now Mustang Village. We&#8217;re working on a partnership with them to where students can lease an apartment at Mustang Village still be through university housing, still have it added to their student account to where they can use their financial aid and other things. But, the idea is we would have Trigg available to our freshman students so that we were not asking as many freshmen to start off campus.&#8221;\nThe feedback on this new housing option is both positive and negative. Some students are excepting this new option because even though they will live off campus, they will still get the benefits of on campus housing.\n&#8220;We are going to operate as university housing, so we&#8217;re going to charge you one flat rate for the semester. That includes your bills, utilities, just like when you live on campus. There&#8217;s no other hidden fees associated. That&#8217;s just your semesterly rent. You will pay that directly to us. Through the business office instead of having to pay it over there. It is going to be for the students that what they could get on campus, the rate for Mustang Village is going to e $2,400 per semester. So for $2,400 you can get a spot in a three bedroom three bath apartment at Mustang Village,&#8221; Mills said\nAssistant Housing Director of the Trigg dorm, Heather Baker, says she&#8217;s heard nothing but god things from the students who currently live in Trigg.\n&#8220;They were actually really excited about the idea, I know some of the girls obviously their excited about the full closets, having less people to a bathroom and with Mustangs Village they&#8217;ll have their own bathroom, bigger bed, more space, they&#8217;re excited about it. The guys reactions were kind of more like, that&#8217;s what they were already planning on doing so they&#8217;re okay with it. They&#8217;re excited about it as well because I think it&#8217;s going to go on their own bills like university bills and they don&#8217;t have to worry about going out on their own and signing a contract,&#8221; Baker said\nThis option is now available to students when they go online and fill out request forms for fall housing. This temporary housing plan will take effect in the fall and only students who meet the requirements to live on campus will be eligible.\n&nbsp;\nThe post Mills: Only freshmen in Trigg; Mustang Village to cost MSU students $2,400\/semester appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1557","lastChanged":"2014-04-02 21:49:00","title":"Theater student creates costumes for God of Carnage","link":"http:\/\/thewichitan.com\/theatre-student-creates-costumes-god-carnage\/","comments":"http:\/\/thewichitan.com\/theatre-student-creates-costumes-god-carnage\/#respond","pubDate":"Wed, 02 Apr 2014 14:22:31 +0000","docCreator":"Kayla Sims","category1":"Campus Watch","category2":"","shortDescription":"<p>Theatre student creates costumes for God of Carnage from MWSU Campus Watch on Vimeo. For three years, Katharine Tate has been involved with the costume crews for the theater department, helping design costumes for the different productions. However, Tate has been able to showcase her creativity by designing and creating the costumes herself for an [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/theatre-student-creates-costumes-god-carnage\/\">Theater student creates costumes for God of Carnage<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"\nTheatre student creates costumes for God of Carnage from MWSU Campus Watch on Vimeo.\nFor three years, Katharine Tate has been involved with the costume crews for the theater department, helping design costumes for the different productions. However, Tate has been able to showcase her creativity by designing and creating the costumes herself for an upcoming show.\n&#8220;This is my first realized design production for God of Carnage, which goes up next week,&#8221; Tate said.\nFor three and a half weeks, she has been in the process of creating the costumes.\n&#8220;The process starts by just basic reading the script, most designers read the script at least three times before they even put pen to paper, and then you can start collecting ideas and images and inspiration. And there&#8217;s a ton of different methods for doing designs, but for this one, we did collages, so I pulled images and inspiration and made collages for each character for the show,&#8221; Tate said.\nTate says the theater department has helped her gain an understanding for the real world experiences by having to bid her designs and pitch her ideas.\nTate already has a plan for when she graduates.\n&#8220;I&#8217;d really like to get on probably with a touring show, as a dresser or designer and I&#8217;d really like to tour internationally,&#8221; she said.\n&nbsp;\n&nbsp;\n&nbsp;\nThe post Theater student creates costumes for God of Carnage appeared first on The Wichitan.\n",
"mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1558","lastChanged":"2014-04-02 21:49:00","title":"Drought impacting MSU outdoor athletics","link":"http:\/\/thewichitan.com\/drought-impacting-msu-outdoor-athletics\/","comments":"http:\/\/thewichitan.com\/drought-impacting-msu-outdoor-athletics\/#respond","pubDate":"Wed, 02 Apr 2014 14:14:26 +0000","docCreator":"Samantha Forester","category1":"Campus","category2":"","shortDescription":"<p>Drought Impacting MSU Outdoor Athletics from MWSU Campus Watch on Vimeo. The city of Wichita Falls has been feeling the heat from the tough drought restrictions. Kyle Owen, associate vice president for facility services said those restrictions have forced the university to change some of its procedures. The most obvious change is through irrigation or [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/drought-impacting-msu-outdoor-athletics\/\">Drought impacting MSU outdoor athletics<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"\nDrought Impacting MSU Outdoor Athletics from MWSU Campus Watch on Vimeo.\nThe city of Wichita Falls has been feeling the heat from the tough drought restrictions. Kyle Owen, associate vice president for facility services said those restrictions have forced the university to change some of its procedures.\nThe most obvious change is through irrigation or the lack of it, Owens said, adding that the campus is no longer using city water to irrigate any of the landscaping. The only irrigation the campus does is use well water for the athletic fields.\nWichita County officials said once the combined lake levels at Lake Arrowhead and Lake Kickapoo hit a combined 25 percent, the city of Wichita Falls would go into Stage 5 drought restrictions,  restrictions that could pose a problem for MSU athletic fields.\nOwen said, even though the campus is using well water on the athletic fields, athletics doesn&#8217;t use as much as much water  as it could if the university had unlimited funds. There’s a safety aspect that’s probably being sacrificed whether we like it or not, Owens said.\nWichita Falls Mayor Glenn Barham said the city is already looking into what a dire situation may look like based on data from previous years.\nWorst case scenario, and that’s the summer of 2011 when we had 100 days of 100-degree temperatures, we have sufficient water to see us through mid-2016, Barham said.\nWell water is used to water the practice fields on campus, but the sand-based football field takes much more water to remain saturated than the softball or soccer fields. Owen said he’s had to look into other options in the event that restrictions get tighter.\n&#8220;When we were deciding whether or not to try and spend the money for the well water harvesting for the football fields, I looked into the amount of water it would take to keep those alive if we trucked it in. It was like 9,000 gallons every 12 hours. That’s assuming the city would sell it to us,&#8221; Owen said.\nBarham said the city is looking into several different ways to bring water to the area.\n“The city has gotten to the point to where we have to try everything that is feasible. We have to think outside the box and do things in hopes that it will provide us some relief,” Barham said.\nThe director of public works for Wichita Falls, Russell Schreiber said the city is anticipating Stage 5 drought restrictions to take effect in the coming months.\n“We anticipate or project that to happen likely around the first of May under current climatic condition. If we get some rain this month that could get pushed back, but right now it looks like the first of May,” Schreiber said.\nWith current drought conditions, city and university officials said they’re willing to look into out of the box ideas to conserve water.\n“We want to make sure we’ve kicked over every rock at this point, in this stage of the drought,” Schreiber said.\nThe post Drought impacting MSU outdoor athletics appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1559","lastChanged":"2014-04-02 21:49:00","title":"International students spread culture","link":"http:\/\/thewichitan.com\/international-students-spread-culture\/","comments":"http:\/\/thewichitan.com\/international-students-spread-culture\/#respond","pubDate":"Wed, 02 Apr 2014 14:11:32 +0000","docCreator":"miguel jaime","category1":"Campus","category2":"","shortDescription":"<p>International Fair from MWSU Campus Watch on Vimeo. International students from all parts of the world gathered in Clark Student Center to share their culture and to speak about the offers their country has. Several international groups held crafts to help entertain students, others performed dances and songs, and other gave presentations to help inform [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/international-students-spread-culture\/\">International students spread culture<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"\nInternational Fair from MWSU Campus Watch on Vimeo.\nInternational students from all parts of the world gathered in Clark Student Center to share their culture and to speak about the offers their country has. Several international groups held crafts to help entertain students, others performed dances and songs, and other gave presentations to help inform students of their countries way of life. Mario Ramirez, student development and orientation activity coordinator, says that the international fair was a great way for students to learn about the different cultures here on campus.\n“There’s over 45 different countries that we have represented at MSU, so I think it’s a really good way to get to know students a little bit more from the different cultures there are, so it just puts them out there, all the different organizations,” Ramirez said.\nAt the event, international students gave food samples to help students learn about the different cuisine their country has to offer. Ramirez says that student development assisted with any financial issues related to food that the student representatives may have faced.\n“Some students can’t afford to buy it and make the food, so we offered to pay for the food as long as they come. So you know that’s kind of a good incentive for them to come and showcase their own country, so not spending any money because it’s tough for some of the college students,” Ramirez said.\nKhalil Innis-King, a senior in management information system&#8217;s, says the international fair is a great way to showcase his culture and to get students interested in learning more.\n“It gets people to know about the different cultures, the different places, the different continents, islands; and international fair shows off just a tiny bit of their culture, just to get you, how do I say, interested in knowing more about them,” Innis-King said.\nInnis-King represents the Caribbean Student Organization and says that this event is a great way to help students learn about other cultural events, such as Caribfest.\n“The more that people know about it, the more they will come to our events, the more money they will spend at our events, the more money we can then give to charity,” Innis-King said.\n&nbsp;\nThe post International students spread culture appeared first on The Wichitan.\n","mediaID":"0","sourceID":"0","articleLink":""},{"articleID":"1560","lastChanged":"2014-04-02 21:49:00","title":"International Fair premieres to dwindling crowd","link":"http:\/\/thewichitan.com\/international-fair-premieres-dwindling-crowd\/","comments":"http:\/\/thewichitan.com\/international-fair-premieres-dwindling-crowd\/#respond","pubDate":"Wed, 02 Apr 2014 02:45:12 +0000","docCreator":"Ethan Metcalf","category1":"Campus","category2":"","shortDescription":"<p>An entire day of cultural programming began on March 29, with the International Fair hosted by the department of Student Development and Orientation. About 40 students attended the fair to see the culture booths and presentations, but the majority of attendees left after the free food samples like Mexican flan and Indian curry had been [&#8230;]<\/p>\n<p>The post <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\/international-fair-premieres-dwindling-crowd\/\">International Fair premieres to dwindling crowd<\/a> appeared first on <a rel=\"nofollow\" href=\"http:\/\/thewichitan.com\">The Wichitan<\/a>.<\/p>\n","longDescription":"<img class=\"size-medium wp-image-13859\" alt=\"Luzmila Moreno, triple major in criminal justice, political science and spanish, joins members of the Midwestern Indian Students Association for a group dance at the International Fair music breakout session on March 29. Photo by Ethan Metcalf.\" src=\"http:\/\/thewichitan.com\/wp-content\/uploads\/2014\/04\/IntFair_0003_web-300x175.jpg\" width=\"300\" height=\"175\" \/>Luzmila Moreno, triple major in criminal justice, political science and spanish, joins members of the Midwestern Indian Students Association for a group dance at the International Fair music breakout session on March 29. Photo by Ethan Metcalf.\nAn entire day of cultural programming began on March 29, with the International Fair hosted by the department of Student Development and Orientation. About 40 students attended the fair to see the culture booths and presentations, but the majority of attendees left after the free food samples like Mexican flan and Indian curry had been given out.\nAccording to Cammie Dean, director of student development and orientation, the lack of attendance at last Saturday&#8217;s International Fair may have been a good thing, though. She said her office was using the event as a test run for next year&#8217;s International Fair.\n&#8220;We weren&#8217;t really shooting to make it huge this year. Next year we&#8217;re going to really open it up, but we wanted to kind of get a feel for how much interest we would get,&#8221; Dean said. &#8221;Next year we&#8217;ll look at planning further out and getting more people involved and getting the community aware because people love to bring kids to these things. It&#8217;ll be a good opportunity for that partnership with the community and invite them onto campus and celebrate with us.&#8221;\nDean said her department wants to expand the International Fair because 45 different countries are represented at the university, but Dean also said there just aren&#8217;t enough events for the students in spring.\n&#8220;It&#8217;s a combination of things, particularly that the bulk of students graduate in May. This is, for a lot of students, a last semester so there&#8217;s lots of that final capstone project thing going on,&#8221; Dean said. &#8220;So there&#8217;s a somewhat greater time commitment academically, but it&#8217;s also a time when the student organizations who are really just kind of coming together in the fall are now seeing their things kicking in. We like to make room for that so that they can do their own thing.&#8221;\nDean said attendance was also hindered by holding the fair on Saturday instead of a school day, but she and other fair organizers will discuss moving the event to a weekday next year.\n&#8220;We&#8217;re probably open to discussion on that one. We don&#8217;t do a lot of weekend things on our campus. It kind of goes both ways. Because we don&#8217;t do a lot of weekend things people aren&#8217;t accustomed to come to weekend things,&#8221; Dean said. &#8220;With every event that we do we&#8217;ll get feedback from the students who participated and we&#8217;ll pull the committee back together and talk about what worked well and what didn&#8217;t and what we want to change.&#8221;\nDean said the most successful event, as well as her favorite, was the cultural expo that kicked off the fair and featured culture booths, crafts and the ever-popular free food.\n&#8220;The expo itself is kind of that sight, sound and taste, even, of various cultures, and then some of the presentations that went on were very exciting. There was some broad overviews and then there was some really specific interesting things,&#8221; Dean said. &#8220;From China she showed how they take the Chinese characters and make words with them. So she showed like &#8216;man&#8217; and something else combined to make the word &#8216;crowd.&#8217; It was really fascinating.&#8221;\nAfter the expo, smaller sessions were held to display more specific aspects of the cultures on display. In Wichita 1 meeting room, music and dance from various cultures were shown as audience members recorded it all on their phones.\nMechanical engineering sophomores Pubuditha Jay, Janith Ambewela and Tharusha Wanigasekera performed Indian love songs for the audience.\n&#8220;It is a love song so it talks about how a couple gets to know each other and how they live their life. It has a good melody,&#8221; Wanigasekera said of the first song they played.\nThat song was a classic from the 1950s, Wanigasekera said, but they played a song written in 2009 next in order to display a wider range of Indian music, and they did it all with no rehearsing.\n&#8220;Actually, this was the rehearsal,&#8221; Ambewela said of the performance as the others laughed. &#8220;We were very busy the week before.&#8221;\nA parade of flags was scheduled for 3:30 p.m., but Dean said it was canceled because there weren&#8217;t enough participants. Instead, a slideshow featuring flags of all 45 countries represented at the university was displayed.\n&#8220;As of Wednesday we only had five countries signed up so I didn’t think we could pull it off, so I kind of pulled back on that one because I didn’t want to do it and not do it well,&#8221; Dean said. &#8220;Next time we’ll solicit separately for the flags cause we kind of solicited with the people who signed up.&#8221;\nDean said she wants to develop more events like the International Fair as part of something she calls &#8220;edu-tainment.&#8221;\n&#8220;We don’t want it to be too much like class, but we still want there to be a beneficial message. In this day and time, for your generation heading out into the work world which is more and more global, there really is a benefit to knowing others, understanding others from different backgrounds and from other countries because we’re increasingly working across borders,&#8221; Dean said. &#8220;So there’s an advantage to that, professionally, but it doesn’t all have to come from a textbook. It’s the practical experience that’s really nice.&#8221;\nThe post International Fair premieres to dwindling crowd appeared first on The Wichitan.\n",
"mediaID":"0","sourceID":"0","articleLink":""}]]}